/*
#############################################################################################
# Unreal Development Kit (2015-02) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.61-UDK
# ========================================================================================= #
# File: Core_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
    #pragma pack ( push, 0x4 )
#endif
#define UGHSDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Core.Object.ProfNodeEvent
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execProfNodeEvent_Parms
{
	union { FString                                    EventName; };                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UObject_execProfNodeEvent_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execProfNodeEvent_Parms() {}
};

// Function Core.Object.ProfNodeSetDepthThreshold
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execProfNodeSetDepthThreshold_Parms
{
	int                                                Depth;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UObject_execProfNodeSetDepthThreshold_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execProfNodeSetDepthThreshold_Parms() {}
};

// Function Core.Object.ProfNodeSetTimeThresholdSeconds
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execProfNodeSetTimeThresholdSeconds_Parms
{
	float                                              Threshold;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UObject_execProfNodeSetTimeThresholdSeconds_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execProfNodeSetTimeThresholdSeconds_Parms() {}
};

// Function Core.Object.ProfNodeStop
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct UObject_execProfNodeStop_Parms
{
	int                                                AssumedTimerIndex;                                		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UObject_execProfNodeStop_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execProfNodeStop_Parms() {}
};

// Function Core.Object.ProfNodeStart
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execProfNodeStart_Parms
{
	union { FString                                    TimerName; };                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execProfNodeStart_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execProfNodeStart_Parms() {}
};

// Function Core.Object.GetStringFromGuid
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetStringFromGuid_Parms
{
	union { struct FGuid                               InGuid; };                                        		// 0x0000 (0x0010) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	union { FString                                    ReturnValue; };                                   		// 0x0010 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UObject_execGetStringFromGuid_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetStringFromGuid_Parms() {}
};

// Function Core.Object.GetGuidFromString
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetGuidFromString_Parms
{
	union { FString                                    InGuidString; };                                  		// 0x0000 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	union { struct FGuid                               ReturnValue; };                                   		// 0x0010 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetGuidFromString_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetGuidFromString_Parms() {}
};

// Function Core.Object.CreateGuid
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execCreateGuid_Parms
{
	union { struct FGuid                               ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execCreateGuid_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execCreateGuid_Parms() {}
};

// Function Core.Object.IsGuidValid
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsGuidValid_Parms
{
	union { struct FGuid                               InGuid; };                                        		// 0x0000 (0x0010) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execIsGuidValid_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execIsGuidValid_Parms() {}
};

// Function Core.Object.InvalidateGuid
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execInvalidateGuid_Parms
{
	union { struct FGuid                               InGuid; };                                        		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UObject_execInvalidateGuid_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execInvalidateGuid_Parms() {}
};

// Function Core.Object.GetLanguage
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetLanguage_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UObject_execGetLanguage_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetLanguage_Parms() {}
};

// Function Core.Object.GetRandomOptionSumFrequency
// [0x00420003] ( FUNC_Final )
struct UObject_execGetRandomOptionSumFrequency_Parms
{
	union { TArray<float>                              FreqList; };                                      		// 0x0000 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           FreqSum;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           RandVal;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             Idx;                                              		// 0x001C (0x0004) [0x0000000000000000]              

	 UObject_execGetRandomOptionSumFrequency_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetRandomOptionSumFrequency_Parms() {}
};

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetBuildChangelistNumber_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetBuildChangelistNumber_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetBuildChangelistNumber_Parms() {}
};

// Function Core.Object.GetEngineVersion
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetEngineVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetEngineVersion_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetEngineVersion_Parms() {}
};

// Function Core.Object.GetSystemTime
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetSystemTime_Parms
{
	int                                                Year;                                             		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Month;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                DayOfWeek;                                        		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Day;                                              		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Hour;                                             		// 0x0010 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Min;                                              		// 0x0014 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Sec;                                              		// 0x0018 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                MSec;                                             		// 0x001C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UObject_execGetSystemTime_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetSystemTime_Parms() {}
};

// Function Core.Object.TimeStamp
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execTimeStamp_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UObject_execTimeStamp_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execTimeStamp_Parms() {}
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execTransformVectorByRotation_Parms
{
	union { struct FRotator                            SourceRotation; };                                		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             SourceVector; };                                  		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInverse;                                         		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	union { struct FVector                             ReturnValue; };                                   		// 0x001C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execTransformVectorByRotation_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execTransformVectorByRotation_Parms() {}
};

// Function Core.Object.GetPackageName
// [0x00020003] ( FUNC_Final )
struct UObject_execGetPackageName_Parms
{
	union { struct FName                               ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UObject*                                  O;                                                		// 0x0008 (0x0008) [0x0000000000000000]              

	 UObject_execGetPackageName_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetPackageName_Parms() {}
};

// Function Core.Object.IsPendingKill
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsPendingKill_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execIsPendingKill_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execIsPendingKill_Parms() {}
};

// Function Core.Object.ByteToFloat
// [0x00024103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execByteToFloat_Parms
{
	unsigned char                                      inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSigned;                                          		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execByteToFloat_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execByteToFloat_Parms() {}
};

// Function Core.Object.FloatToByte
// [0x00024103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execFloatToByte_Parms
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSigned;                                          		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0008 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execFloatToByte_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execFloatToByte_Parms() {}
};

// Function Core.Object.UnwindHeading
// [0x00022103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execUnwindHeading_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execUnwindHeading_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execUnwindHeading_Parms() {}
};

// Function Core.Object.FindDeltaAngle
// [0x00022103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execFindDeltaAngle_Parms
{
	float                                              A1;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              A2;                                               		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           Delta;                                            		// 0x000C (0x0004) [0x0000000000000000]              

	 UObject_execFindDeltaAngle_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execFindDeltaAngle_Parms() {}
};

// Function Core.Object.GetHeadingAngle
// [0x00022103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execGetHeadingAngle_Parms
{
	union { struct FVector                             Dir; };                                           		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           Angle;                                            		// 0x0010 (0x0004) [0x0000000000000000]              

	 UObject_execGetHeadingAngle_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetHeadingAngle_Parms() {}
};

// Function Core.Object.GetAngularDegreesFromRadians
// [0x00422103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execGetAngularDegreesFromRadians_Parms
{
	union { struct FVector2D                           OutFOV; };                                        		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UObject_execGetAngularDegreesFromRadians_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetAngularDegreesFromRadians_Parms() {}
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetAngularFromDotDist_Parms
{
	union { struct FVector2D                           OutAngDist; };                                    		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { struct FVector2D                           DotDist; };                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UObject_execGetAngularFromDotDist_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetAngularFromDotDist_Parms() {}
};

// Function Core.Object.GetAngularDistance
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetAngularDistance_Parms
{
	union { struct FVector2D                           OutAngularDist; };                                		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { struct FVector                             Direction; };                                     		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             AxisX; };                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             AxisY; };                                         		// 0x0020 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             AxisZ; };                                         		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0038 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetAngularDistance_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetAngularDistance_Parms() {}
};

// Function Core.Object.GetDotDistance
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetDotDistance_Parms
{
	union { struct FVector2D                           OutDotDist; };                                    		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { struct FVector                             Direction; };                                     		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             AxisX; };                                         		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             AxisY; };                                         		// 0x0020 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             AxisZ; };                                         		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0038 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetDotDistance_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetDotDistance_Parms() {}
};

// Function Core.Object.PointProjectToPlane
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execPointProjectToPlane_Parms
{
	union { struct FVector                             Point; };                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             A; };                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             B; };                                             		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             C; };                                             		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             ReturnValue; };                                   		// 0x0030 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execPointProjectToPlane_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execPointProjectToPlane_Parms() {}
};

// Function Core.Object.PointDistToPlane
// [0x00C24103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execPointDistToPlane_Parms
{
	union { struct FVector                             Point; };                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FRotator                            Orientation; };                                   		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             Origin; };                                        		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             out_ClosestPoint; };                              		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// union { struct FVector                          AxisX; };                                         		// 0x0034 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          AxisY; };                                         		// 0x0040 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          AxisZ; };                                         		// 0x004C (0x000C) [0x0000000000000000]              
	// union { struct FVector                          PointNoZ; };                                      		// 0x0058 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          OriginNoZ; };                                     		// 0x0064 (0x000C) [0x0000000000000000]              
	// float                                           fPointZ;                                          		// 0x0070 (0x0004) [0x0000000000000000]              
	// float                                           fProjDistToAxis;                                  		// 0x0074 (0x0004) [0x0000000000000000]              

	 UObject_execPointDistToPlane_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execPointDistToPlane_Parms() {}
};

// Function Core.Object.PointDistToSegment
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct UObject_execPointDistToSegment_Parms
{
	union { struct FVector                             Point; };                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             StartPoint; };                                    		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             EndPoint; };                                      		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             OutClosestPoint; };                               		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execPointDistToSegment_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execPointDistToSegment_Parms() {}
};

// Function Core.Object.PointDistToLine
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct UObject_execPointDistToLine_Parms
{
	union { struct FVector                             Point; };                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             Line; };                                          		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             Origin; };                                        		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             OutClosestPoint; };                               		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execPointDistToLine_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execPointDistToLine_Parms() {}
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetPerObjectConfigSections_Parms
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<FString>                            out_SectionNames; };                              		// 0x0008 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class UObject*                                     ObjectOuter;                                      		// 0x0018 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                MaxResults;                                       		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0024 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetPerObjectConfigSections_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetPerObjectConfigSections_Parms() {}
};

// Function Core.Object.ImportJSON
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execImportJSON_Parms
{
	union { FString                                    PropertyName; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    JSON; };                                          		// 0x0010 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UObject_execImportJSON_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execImportJSON_Parms() {}
};

// Function Core.Object.StaticSaveConfig
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execStaticSaveConfig_Parms
{

	 UObject_execStaticSaveConfig_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execStaticSaveConfig_Parms() {}
};

// Function Core.Object.SaveConfig
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x0218]
struct UObject_execSaveConfig_Parms
{

	 UObject_execSaveConfig_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execSaveConfig_Parms() {}
};

// Function Core.Object.FindObject
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execFindObject_Parms
{
	union { FString                                    ObjectName; };                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execFindObject_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execFindObject_Parms() {}
};

// Function Core.Object.DynamicLoadObject
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct UObject_execDynamicLoadObject_Parms
{
	union { FString                                    ObjectName; };                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      MayFail;                                          		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UObject*                                     ReturnValue;                                      		// 0x001C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execDynamicLoadObject_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execDynamicLoadObject_Parms() {}
};

// Function Core.Object.EnumFromString
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execEnumFromString_Parms
{
	class UObject*                                     E;                                                		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FName                               ValueName; };                                     		// 0x0008 (0x0008) [0x0000000000000880]              ( CPF_Parm | CPF_CoerceParm )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execEnumFromString_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execEnumFromString_Parms() {}
};

// Function Core.Object.GetEnum
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetEnum_Parms
{
	class UObject*                                     E;                                                		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                I;                                                		// 0x0008 (0x0004) [0x0000000000000880]              ( CPF_Parm | CPF_CoerceParm )
	union { struct FName                               ReturnValue; };                                   		// 0x000C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetEnum_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetEnum_Parms() {}
};

// Function Core.Object.Disable
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x0076]
struct UObject_execDisable_Parms
{
	union { struct FName                               ProbeFunc; };                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UObject_execDisable_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execDisable_Parms() {}
};

// Function Core.Object.Enable
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x0075]
struct UObject_execEnable_Parms
{
	union { struct FName                               ProbeFunc; };                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UObject_execEnable_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execEnable_Parms() {}
};

// Function Core.Object.ContinuedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventContinuedState_Parms
{

	 UObject_eventContinuedState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_eventContinuedState_Parms() {}
};

// Function Core.Object.PausedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventPausedState_Parms
{

	 UObject_eventPausedState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_eventPausedState_Parms() {}
};

// Function Core.Object.PoppedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventPoppedState_Parms
{

	 UObject_eventPoppedState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_eventPoppedState_Parms() {}
};

// Function Core.Object.PushedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventPushedState_Parms
{

	 UObject_eventPushedState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_eventPushedState_Parms() {}
};

// Function Core.Object.EndState
// [0x00020800] ( FUNC_Event )
struct UObject_eventEndState_Parms
{
	union { struct FName                               NextStateName; };                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UObject_eventEndState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_eventEndState_Parms() {}
};

// Function Core.Object.BeginState
// [0x00020800] ( FUNC_Event )
struct UObject_eventBeginState_Parms
{
	union { struct FName                               PreviousStateName; };                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UObject_eventBeginState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_eventBeginState_Parms() {}
};

// Function Core.Object.DumpStateStack
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execDumpStateStack_Parms
{

	 UObject_execDumpStateStack_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execDumpStateStack_Parms() {}
};

// Function Core.Object.PopState
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execPopState_Parms
{
	unsigned long                                      bPopAll;                                          		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UObject_execPopState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execPopState_Parms() {}
};

// Function Core.Object.PushState
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execPushState_Parms
{
	union { struct FName                               NewState; };                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FName                               NewLabel; };                                      		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UObject_execPushState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execPushState_Parms() {}
};

// Function Core.Object.GetStateName
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x011C]
struct UObject_execGetStateName_Parms
{
	union { struct FName                               ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetStateName_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetStateName_Parms() {}
};

// Function Core.Object.IsChildState
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsChildState_Parms
{
	union { struct FName                               TestState; };                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FName                               TestParentState; };                               		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execIsChildState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execIsChildState_Parms() {}
};

// Function Core.Object.IsInState
// [0x00024401] ( FUNC_Final | FUNC_Native ) iNative [0x0119]
struct UObject_execIsInState_Parms
{
	union { struct FName                               TestState; };                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bTestStateStack;                                  		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execIsInState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execIsInState_Parms() {}
};

// Function Core.Object.GotoState
// [0x00024401] ( FUNC_Final | FUNC_Native ) iNative [0x0071]
struct UObject_execGotoState_Parms
{
	union { struct FName                               NewState; };                                      		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	union { struct FName                               Label; };                                         		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bForceEvents;                                     		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bKeepStack;                                       		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UObject_execGotoState_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGotoState_Parms() {}
};

// Function Core.Object.IsUTracing
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsUTracing_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execIsUTracing_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execIsUTracing_Parms() {}
};

// Function Core.Object.SetUTracing
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execSetUTracing_Parms
{
	unsigned long                                      bShouldUTrace;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UObject_execSetUTracing_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execSetUTracing_Parms() {}
};

// Function Core.Object.GetFuncName
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetFuncName_Parms
{
	union { struct FName                               ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetFuncName_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetFuncName_Parms() {}
};

// Function Core.Object.DebugBreak
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct UObject_execDebugBreak_Parms
{
	int                                                UserFlags;                                        		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      DebuggerType;                                     		// 0x0004 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UObject_execDebugBreak_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execDebugBreak_Parms() {}
};

// Function Core.Object.GetScriptTrace
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetScriptTrace_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UObject_execGetScriptTrace_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetScriptTrace_Parms() {}
};

// Function Core.Object.ScriptTrace
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execScriptTrace_Parms
{

	 UObject_execScriptTrace_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execScriptTrace_Parms() {}
};

// Function Core.Object.ParseLocalizedPropertyPath
// [0x00022003] ( FUNC_Final )
struct UObject_execParseLocalizedPropertyPath_Parms
{
	union { FString                                    PathName; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    ReturnValue; };                                   		// 0x0010 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// union { TArray<FString>                         Pieces; };                                        		// 0x0020 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

	 UObject_execParseLocalizedPropertyPath_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execParseLocalizedPropertyPath_Parms() {}
};

// Function Core.Object.Localize
// [0x00022400] ( FUNC_Native )
struct UObject_execLocalize_Parms
{
	union { FString                                    SectionName; };                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    KeyName; };                                       		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    PackageName; };                                   		// 0x0020 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    ReturnValue; };                                   		// 0x0030 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UObject_execLocalize_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execLocalize_Parms() {}
};

// Function Core.Object.WarnInternal
// [0x00022401] ( FUNC_Final | FUNC_Native ) iNative [0x00E8]
struct UObject_execWarnInternal_Parms
{
	union { FString                                    S; };                                             		// 0x0000 (0x0010) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )

	 UObject_execWarnInternal_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execWarnInternal_Parms() {}
};

// Function Core.Object.LogInternal
// [0x00026401] ( FUNC_Final | FUNC_Native ) iNative [0x00E7]
struct UObject_execLogInternal_Parms
{
	union { FString                                    S; };                                             		// 0x0000 (0x0010) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	union { struct FName                               Tag; };                                           		// 0x0010 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UObject_execLogInternal_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execLogInternal_Parms() {}
};

// Function Core.Object.Subtract_LinearColorLinearColor
// [0x00023003] ( FUNC_Final )
struct UObject_execSubtract_LinearColorLinearColor_Parms
{
	union { struct FLinearColor                        A; };                                             		// 0x0000 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	union { struct FLinearColor                        B; };                                             		// 0x0010 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	union { struct FLinearColor                        ReturnValue; };                                   		// 0x0020 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execSubtract_LinearColorLinearColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execSubtract_LinearColorLinearColor_Parms() {}
};

// Function Core.Object.Multiply_LinearColorFloat
// [0x00023003] ( FUNC_Final )
struct UObject_execMultiply_LinearColorFloat_Parms
{
	union { struct FLinearColor                        LC; };                                            		// 0x0000 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	float                                              Mult;                                             		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FLinearColor                        ReturnValue; };                                   		// 0x0014 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execMultiply_LinearColorFloat_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execMultiply_LinearColorFloat_Parms() {}
};

// Function Core.Object.ColorToLinearColor
// [0x00022003] ( FUNC_Final )
struct UObject_execColorToLinearColor_Parms
{
	union { struct FColor                              OldColor; };                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FLinearColor                        ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execColorToLinearColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execColorToLinearColor_Parms() {}
};

// Function Core.Object.MakeLinearColor
// [0x00822003] ( FUNC_Final )
struct UObject_execMakeLinearColor_Parms
{
	float                                              R;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              G;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              A;                                                		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FLinearColor                        ReturnValue; };                                   		// 0x0010 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// union { struct FLinearColor                     LC; };                                            		// 0x0020 (0x0010) [0x0000000000000000]              

	 UObject_execMakeLinearColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execMakeLinearColor_Parms() {}
};

// Function Core.Object.LerpColor
// [0x00822003] ( FUNC_Final )
struct UObject_execLerpColor_Parms
{
	union { struct FColor                              A; };                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              B; };                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Alpha;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              ReturnValue; };                                   		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// union { struct FVector                          FloatA; };                                        		// 0x0010 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          FloatB; };                                        		// 0x001C (0x000C) [0x0000000000000000]              
	// union { struct FVector                          FloatResult; };                                   		// 0x0028 (0x000C) [0x0000000000000000]              
	// float                                           AlphaA;                                           		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           AlphaB;                                           		// 0x0038 (0x0004) [0x0000000000000000]              
	// float                                           FloatResultAlpha;                                 		// 0x003C (0x0004) [0x0000000000000000]              
	// union { struct FColor                           Result; };                                        		// 0x0040 (0x0004) [0x0000000000000000]              

	 UObject_execLerpColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execLerpColor_Parms() {}
};

// Function Core.Object.MakeColor
// [0x00826003] ( FUNC_Final )
struct UObject_execMakeColor_Parms
{
	unsigned char                                      R;                                                		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      G;                                                		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      B;                                                		// 0x0002 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      A;                                                		// 0x0003 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	union { struct FColor                              ReturnValue; };                                   		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// union { struct FColor                           C; };                                             		// 0x0008 (0x0004) [0x0000000000000000]              

	 UObject_execMakeColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execMakeColor_Parms() {}
};

// Function Core.Object.Add_ColorColor
// [0x00023003] ( FUNC_Final )
struct UObject_execAdd_ColorColor_Parms
{
	union { struct FColor                              A; };                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              B; };                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              ReturnValue; };                                   		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execAdd_ColorColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execAdd_ColorColor_Parms() {}
};

// Function Core.Object.Multiply_ColorFloat
// [0x00023003] ( FUNC_Final )
struct UObject_execMultiply_ColorFloat_Parms
{
	union { struct FColor                              A; };                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              ReturnValue; };                                   		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execMultiply_ColorFloat_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execMultiply_ColorFloat_Parms() {}
};

// Function Core.Object.Multiply_FloatColor
// [0x00023003] ( FUNC_Final )
struct UObject_execMultiply_FloatColor_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              B; };                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              ReturnValue; };                                   		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execMultiply_FloatColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execMultiply_FloatColor_Parms() {}
};

// Function Core.Object.Subtract_ColorColor
// [0x00023003] ( FUNC_Final )
struct UObject_execSubtract_ColorColor_Parms
{
	union { struct FColor                              A; };                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              B; };                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FColor                              ReturnValue; };                                   		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execSubtract_ColorColor_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execSubtract_ColorColor_Parms() {}
};

// Function Core.Object.EvalInterpCurveVector2D
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execEvalInterpCurveVector2D_Parms
{
	union { struct FInterpCurveVector2D                Vector2DCurve; };                                 		// 0x0000 (0x0014) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	float                                              InVal;                                            		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector2D                           ReturnValue; };                                   		// 0x0018 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execEvalInterpCurveVector2D_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execEvalInterpCurveVector2D_Parms() {}
};

// Function Core.Object.EvalInterpCurveVector
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execEvalInterpCurveVector_Parms
{
	union { struct FInterpCurveVector                  VectorCurve; };                                   		// 0x0000 (0x0014) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	float                                              InVal;                                            		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             ReturnValue; };                                   		// 0x0018 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execEvalInterpCurveVector_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execEvalInterpCurveVector_Parms() {}
};

// Function Core.Object.EvalInterpCurveFloat
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execEvalInterpCurveFloat_Parms
{
	union { struct FInterpCurveFloat                   FloatCurve; };                                    		// 0x0000 (0x0014) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	float                                              InVal;                                            		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execEvalInterpCurveFloat_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execEvalInterpCurveFloat_Parms() {}
};

// Function Core.Object.vect2d
// [0x00822003] ( FUNC_Final )
struct UObject_execvect2d_Parms
{
	float                                              InX;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InY;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector2D                           ReturnValue; };                                   		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// union { struct FVector2D                        NewVect2d; };                                     		// 0x0010 (0x0008) [0x0000000000000000]              

	 UObject_execvect2d_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execvect2d_Parms() {}
};

// Function Core.Object.GetMappedRangeValue
// [0x00022501] ( FUNC_Final | FUNC_Simulated | FUNC_Native )
struct UObject_execGetMappedRangeValue_Parms
{
	union { struct FVector2D                           InputRange; };                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector2D                           OutputRange; };                                   		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Value;                                            		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetMappedRangeValue_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetMappedRangeValue_Parms() {}
};

// Function Core.Object.GetRangePctByValue
// [0x00022103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execGetRangePctByValue_Parms
{
	union { struct FVector2D                           Range; };                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UObject_execGetRangePctByValue_Parms() { memset(this, 0, sizeof *this); }
	~UObject_execGetRangePctByValue_Parms() {}
};

// Function Core.Object.GetRangeValueByPct
// [0x00022103] ( FUNC_Final | FUNC_Simulated )
struct UObject_execGetRangeValueByPct_Parms
{
	union { struct FVector2D                           Range; };                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
